#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success
#### Terraform Validation 🤖`success`
#### Integration Tests `success`
#### Terraform Plan 📖`success`

<details><summary>Show Integration Test Results</summary>

``` 


```

</details>

<details><summary>Show Plan</summary>

```terraform

data.aws_iam_policy_document.apigw_assume_role: Reading...
data.aws_iam_policy_document.apigw_assume_role: Read complete after 0s [id=766475153]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
 <= read (data resources)

Terraform will perform the following actions:

  # data.aws_iam_policy_document.dynamodb_crud_policy will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "dynamodb_crud_policy" {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions   = [
              + "dynamodb:DeleteItem",
              + "dynamodb:GetItem",
              + "dynamodb:PutItem",
              + "dynamodb:UpdateItem",
            ]
          + effect    = "Allow"
          + resources = [
              + (known after apply),
            ]
          + sid       = "dynamodbtablepolicy"
        }
    }

  # data.template_file.books_api will be read during apply
  # (config refers to values not yet known)
 <= data "template_file" "books_api" {
      + id       = (known after apply)
      + rendered = (known after apply)
      + template = <<-EOT
            openapi: 3.0.3
            
            info:
              title: DynamoDB to Opensearch
              description: An API for CRUD operations on a DynamoDB table
              version: "1.0.0"
            
            paths:
              /books:
                post: 
                  x-amazon-apigateway-integration:
                    type: aws
                    uri: "arn:aws:apigateway:${aws_region}:dynamodb:action/PutItem"
                    httpMethod: POST 
                    passthroughBehavior: when_no_match
                    credentials: ${apigw_role_arn}
                    requestTemplates:
                      application/json: |
                        #set($inputRoot = $input.path('$'))
                        {
                          "TableName": "${books_table_name}",
                          "Item": {
                            "book_id": { "S": "$context.requestId" },
                            "title": { "S": "$inputRoot.title" },
                            "author": { "S": "$inputRoot.author" }
                          }
                        }
                    responses:
                      default:
                        statusCode: 200
                        responseTemplates:
                          application/json: |
                            {
                              "message": "New book created.",
                              "book_id": "$context.requestId"
                            }
                  tags:
                    - book 
                  summary: add a new bookupdate
                  operationId: addBook
                  responses:
                    '200':
                      description: successful operation
                      content:
                        application/json:
                          schema:
                            $ref: '#/components/schemas/BookWithId'
                    '405':
                      description: Invalid Input
                  requestBody:
                    $ref: '#/components/requestBodies/Book'
              /books/{bookId}:
                get:
                  x-amazon-apigateway-integration: 
                    type: aws 
                    uri: "arn:aws:apigateway:${aws_region}:dynamodb:action/GetItem"
                    httpMethod: POST
                    passthroughBehavior: when_no_match
                    credentials: ${apigw_role_arn}
                    requestTemplates:
                      application/json: |
                        {
                          "TableName": "${books_table_name}",
                          "Key": {
                            "book_id": { "S": "$input.params('bookId')" }
                          }
                        }
                    responses: 
                      default:
                        statusCode: 200
                        responseTemplates:
                          application/json: |
                            #set($inputRoot = $input.path('$'))
                            {
                              "book_id": "$inputRoot.Item.book_id.S",
                              "title": "$inputRoot.Item.title.S",
                              "author": "$inputRoot.Item.author.S"
                            }
                  responses:
                    '200': 
                      description: successful operation
                      content:
                        application/json:
                          schema:
                            $ref: '#/components/schemas/BookWithId'
                put:
                  x-amazon-apigateway-integration:
                    type: aws
                    uri: "arn:aws:apigateway:${aws_region}:dynamodb:action/UpdateItem"
                    httpMethod: POST
                    passthroughBehavior: when_no_match
                    credentials: ${apigw_role_arn}
                    requestTemplates:
                      application/json: |
                        #set($inputRoot = $input.path('$'))
                        {
                          "TableName": "${books_table_name}",
                          "Key": {
                            "book_id": { "S": "$input.params('bookId')" }
                          },
                          "UpdateExpression": "set title = :title, author = :author",
                          "ExpressionAttributeValues": {
                            ":title": { "S": "$inputRoot.title"},
                            ":author": {"S": "$inputRoot.author"}
                          },
                          "ReturnValues": "ALL_NEW"
                        }
                    responses: 
                      default:
                        statusCode: 200
                        responseTemplates:
                          application/json: |
                            #set($inputRoot = $input.path('$'))
                            {
                              "book_id": "$inputRoot.Attributes.book_id.S",
                              "title": "$inputRoot.Attributes.title.S",
                              "author": "$inputRoot.Attributes.author.S"
                            }
                  responses:
                    '200':
                      description: successful operation
                      content:
                        application/json:
                          schema:
                            $ref: '#/components/schemas/BookWithId'
                  requestBody:
                    $ref: '#/components/requestBodies/Book'
                delete:
                  x-amazon-apigateway-integration:
                    type: aws
                    uri: "arn:aws:apigateway:${aws_region}:dynamodb:action/DeleteItem"
                    httpMethod: POST
                    passthroughBehavior: when_no_match
                    credentials: ${apigw_role_arn}
                    requestTemplates:
                      application/json: |
                        #set($inputRoot = $input.path('$'))
                        {
                          "TableName": "${books_table_name}",
                          "Key": {
                            "book_id": { "S": "$input.params('bookId')" }
                          }
                        }
                    responses: 
                      default:
                        statusCode: 204
                  responses:
                    '204':
                      description: successful operation          
            components:
              schemas:
                Book: 
                  type: object 
                  required:
                    - title
                    - author 
                  properties:
                    title:
                      type: string 
                    author:
                      type: string 
                BookWithId:
                  allOf:
                    - $ref: '#/components/schemas/Book'
                    - type: object 
                      required:
                        - bookId
                      properties:
                        BookId: 
                          type: string 
                          format: uuid
              requestBodies:
                Book: 
                  content:
                    application/json:
                      schema:
                        $ref: '#/components/schemas/Book'
        EOT
      + vars     = {
          + "apigw_role_arn"   = (known after apply)
          + "aws_region"       = "us-west-2"
          + "books_table_name" = "actions-and-terraform-pipeline-uat-books"
        }
    }

  # aws_api_gateway_deployment.deployment will be created
  + resource "aws_api_gateway_deployment" "deployment" {
      + created_date  = (known after apply)
      + execution_arn = (known after apply)
      + id            = (known after apply)
      + invoke_url    = (known after apply)
      + rest_api_id   = (known after apply)
      + triggers      = (known after apply)
    }

  # aws_api_gateway_rest_api.api will be created
  + resource "aws_api_gateway_rest_api" "api" {
      + api_key_source               = "HEADER"
      + arn                          = (known after apply)
      + binary_media_types           = (known after apply)
      + body                         = (known after apply)
      + created_date                 = (known after apply)
      + description                  = "Books API"
      + disable_execute_api_endpoint = (known after apply)
      + execution_arn                = (known after apply)
      + id                           = (known after apply)
      + minimum_compression_size     = -1
      + name                         = "actions-and-terraform-pipeline-uat-api"
      + policy                       = (known after apply)
      + root_resource_id             = (known after apply)
      + tags_all                     = (known after apply)

      + endpoint_configuration {
          + types            = [
              + "REGIONAL",
            ]
          + vpc_endpoint_ids = (known after apply)
        }
    }

  # aws_api_gateway_stage.stage will be created
  + resource "aws_api_gateway_stage" "stage" {
      + arn           = (known after apply)
      + deployment_id = (known after apply)
      + execution_arn = (known after apply)
      + id            = (known after apply)
      + invoke_url    = (known after apply)
      + rest_api_id   = (known after apply)
      + stage_name    = "uat"
      + tags_all      = (known after apply)
      + web_acl_arn   = (known after apply)
    }

  # aws_dynamodb_table.books will be created
  + resource "aws_dynamodb_table" "books" {
      + arn              = (known after apply)
      + billing_mode     = "PAY_PER_REQUEST"
      + hash_key         = "book_id"
      + id               = (known after apply)
      + name             = "actions-and-terraform-pipeline-uat-books"
      + read_capacity    = (known after apply)
      + stream_arn       = (known after apply)
      + stream_enabled   = true
      + stream_label     = (known after apply)
      + stream_view_type = "NEW_IMAGE"
      + tags_all         = (known after apply)
      + write_capacity   = (known after apply)

      + attribute {
          + name = "book_id"
          + type = "S"
        }

      + point_in_time_recovery {
          + enabled = (known after apply)
        }

      + server_side_encryption {
          + enabled     = (known after apply)
          + kms_key_arn = (known after apply)
        }

      + ttl {
          + attribute_name = (known after apply)
          + enabled        = (known after apply)
        }
    }

  # aws_iam_policy.api_dynamodb_policy will be created
  + resource "aws_iam_policy" "api_dynamodb_policy" {
      + arn       = (known after apply)
      + id        = (known after apply)
      + name      = "actions-and-terraform-pipeline-uat-dynamodb-crud-policy"
      + path      = "/"
      + policy    = (known after apply)
      + policy_id = (known after apply)
      + tags_all  = (known after apply)
    }

  # aws_iam_role.api_role will be created
  + resource "aws_iam_role" "api_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "apigateway.amazonaws.com"
                        }
                      + Sid       = "AssumeRolePolicy"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "actions-and-terraform-pipeline-uat-api-role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

  # aws_iam_role_policy_attachment.api_dynamodb_policy_attachment will be created
  + resource "aws_iam_role_policy_attachment" "api_dynamodb_policy_attachment" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "actions-and-terraform-pipeline-uat-api-role"
    }

Plan: 7 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + api_invoke_url = (known after apply)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pushed by: @lukewyman, Action: `pull_request`*